simulations/VOF/sim15/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-5 -3 -0.1) //0
    (5 -3 -0.1)  //1
    (5 4 -0.1)   //2
    (-5 4 -0.1)  //3
    (-5 -3 0.1)  //4
    (5 -3 0.1)   //5
    (5 4 0.1)    //6
    (-5 4 0.1)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (350 150 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (7 3 0 4)
        );
    }

    right
    {
        type wall;
        faces
        (
            (5 1 2 6)
        );
    }

    top
    {
        type patch;
        faces
        (
            (7 6 2 3)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)   
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
